OscillatingCylinder/case/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    //default         Gauss linear;
    default cellMDLimited Gauss linear 0;
    grad(U) cellMDLimited Gauss linear 0;
}

divSchemes
{
    default         Gauss linearUpwind grad(U);
    //div(phi,U)      Gauss linear;
    div(phi,U) Gauss linearUpwind grad(U);
    //div(phi,U)     Gauss limitedLinear 1;
}
/*divSchemes
{
    default         Gauss cubic;
    div(phi,U)      Gauss cubic;
}*/


laplacianSchemes
{
    default         Gauss linear limited 1.0;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         limited 1.0;
}


// ************************************************************************* //
